# 백준 10422번 G4
# 괄호

'''
2 > () 1
4 > ()() (()) 2
6 > ((())) (())() ()(()) ()()() (()()) 5
8 > 14
    6개로 만들 수 있는 갯수 >> 1
    4개로 만들 수 있는 갯수(1번 감싸는 것) * 2 ()       dp[n-2] * 2
    2개로 만들 수 있는 갯수(1번 감싸는 것) * 2 ()()     dp[n-4] * 2
    0개로 마들 수 있는 갯수 >> 1 ()()()
    dp[6]        (((()))) ((())()) (()(())) (()()()) ((()())) 5
    dp[4] ()     ()(()()) ()((())) (()())() ((()))() 4 
    dp[2] ()()   ()()(()) ()(())() (())()()  3
    dp[0] ()()() ()()()() 1
                 (())(())

    (()(()))
    ((()()))
    (()()())
    (((())))
    ((())())
    

    (((()))) : 1개
    () : 4개짜리를 한 번 감싸서 * 2
    ()() : 2개짜리를 한 번 감싸서 ()1() ()()1 1()()
    ()()() : 0개짜리를 한 번 감싸서 ()()()() 1개

    ()()()1  



    (((()))) ((())()) (()(())) (()()()) ((()())) 5개
    ()(()()) ()((())) (()())() ((()))() 4개
    ()()(()) ()(())() (())()()  3개
    ()()()() 1개
'''
# i = 2의 배수
# () 0개 : dp[n-(i*2)] * (0 + 1)  # 5
# () 1개 : dp[n-(i*4)] * (1 + 1)  # 4
# () 2개 : dp[n-(i*6)] * (2 + 1)  # 3
# if n-i == 0: 1                  # 1

# i = n // 2 - 2
# se[8] : dp[2] ** 2
# se[16] : dp[6] ** 2
# se[32] : dp[14] ** 2
# dp_second = [0] * 5001
# dp_second[8] = 1    (())(())   8 // 4 개로 만들 수 있는 경우의 수
# if n == 2의 제곱수이면
# while n // 2 != 4:
#   

import sys
input = sys.stdin.readline

T = int(input())

# (**)**
# dp[n] = dp[k-2] * dp[n-k]
dp = [0] * 5001
dp[0] = 1
dp[2] = 1

for i in range(4, 5001, 2):
    for j in range(2, i+1, 2):
        dp[i] += dp[j-2] * dp[i-j]

    dp[i] = dp[i] % 1000000007
for _ in range(T):
    n = int(input())
    print(dp[n])

# T = int(input())

# dp = [0] * 5001
# dp[2] = 1
# for i in range(4, 5001, 2):
#     cnt = 0
    
#     j = 0
#     while (i - j) != 0:
#         tmp_j = j // 2 - 1
#         cnt += dp[i-j] * (tmp_j + 1)
#         j += 2
    
#     if (i // 2) % 2 == 0:
#         temp = i // 2 - 2
#         cnt += dp[temp] ** 2
        

#     cnt += 1

#     dp[i] = cnt % 1000000007

# for _ in range(T):
#     n = int(input())
#     print(dp[n])
        

# def binomial(n, k):
#     res = 1
#     for i in range(k):
#         res = res*(n-i)
#         res = res//(i+1)
#     return res
 
# def catalan(n):
#     c = binomial(2*n, n)
#     return c//(n+1)
 
# T = int(input())
 
# for i in range(T):
#     n = int(input())
    
#     if n % 2 != 0:
#         print(0)
#         continue
        
#     print(catalan(n//2)%1000000007)

